slides/rakuten_api.org
#+STARTUP: beamer
#+LATEX_CLASS: beamer
#+OPTIONS: H:2 num:2 toc:nil
#+BEAMER_THEME: Berkeley
#+BEAMER_COLOR_THEME: whale
#+TITLE: 楽天APIを利用したアプリケーション
#+AUTHOR: 中鉢 欣秀・上田 隆一
#+DATE:
#+LATEX_HEADER: \institute[AIIT]{産業技術大学院大学(AIIT)}

* 楽天API
** 楽天APIとは？
   - [[http://webservice.rakuten.co.jp/document/][楽天ウェブサービス: API一覧]]

** サンプルアプリ
- [[https://github.com/ryuichiueda/rakuten_enpit_example][Rakuten enPiT Example]]
  - =git clone= する
- =bundle install= する
- Herokuでアプリを作りアプリURLを取得
  - =heroku create= する

** アプリIDの発行
   - 新規アプリを登録する
     - [[https://webservice.rakuten.co.jp/app/create][楽天ウェブサービス: 新規アプリ登録]]
   - アプリ名（任意），アプリのURL，認証コードを入力
     - アプリID，アフィリエイトID等を控えておく

** 環境変数の設定
   - アプリID（APPID）とアフィリエイトID（AFID）を環境変数に登録
   - =~/.bash_profile= に次の行を追加（自分のID等に書き換えること）
   - =exit= して，再度 =vagrant ssh=

#+begin_src bash
export APPID=102266705971259xxxx
export AFID=11b23d92.8f6b6ff4.11b23d93.???????
#+end_src

** ローカルでの動作確認
   - ローカルで動作確認する

#+begin_src bash
ruby hello.rb -o 0.0.0.0
#+end_src

* Herokuで動作させる
** Herokuの環境変数
   - 次のコマンドで，Heroku内部にも環境変数を作る
   - 参考
     - [[https://devcenter.heroku.com/articles/config-vars][Configuration and Config Vars | Heroku Dev Center]]

#+begin_src bash
heroku config:set APPID=102266705971259xxxx
heroku config:set AFID=11b23d92.8f6b6ff4.11b23d93.???????
#+end_src

** Herokuでの動作確認
   - Herokuに直接Pushしてみる
   - webブラウザで動作確認

#+begin_src bash
git push heroku master
#+end_src

* Travis CI連携
** .travis.ymlの再生成
*** 内容
   - =fork= して作業用のブランチを作成する
   - .travis.yml の削除と新規作成
   - 不要なRubyのバージョンを削除
*** コマンド
#+begin_src bash
git fork
git branch new_feature
rm .travis.yml
travis init
travis heroku setup
emacs .travis.yml
#+end_src

** Travis CIの環境変数
*** 内容
   - リポジトリで次のコマンドを打つ
   - 自分のAPPID，AFIDに書き換えること
*** コマンド
#+begin_src bash
travis env set APPID 102266705971259xxxx
travis env set AFID 11b23d92.8f6b6ff4.11b23d93.???????
#+end_src

** コミットしてpush
*** 内容
    - =add= して =commit=
    - 自分のリポジトリにpush
*** コマンド
#+begin_src bash
git add .
git commit -m 'Update .travis.yml'
git push -u ychubach master
#+end_src

   

* 演習
** ローカルでサンプルを動かす
   - 自分のAPPIDを作成する
   - 仮想化環境とHerokuの環境変数を設定
   - ローカルで動かしてみよう
   - Herokuに直接Pushして動かしてみよう
** Travis経由で動かしてみよう
   - サンプルをTravis経由で動作させてみよう
     - Forkして，自分のリポジトリにpushできるようにする
     - =.travis.yml= の設定を変更する
       - やり方は各自で考えてみよう
     - Travis CIに環境変数を設定する
     
