slides/rakuten_api.tex
% Created 2014-09-25 木 16:11
\documentclass[t]{beamer}
\usepackage{zxjatype}
\usepackage[ipa]{zxjafont}
\setbeamertemplate{navigation symbols}{}
\hypersetup{colorlinks,linkcolor=,urlcolor=gray}
\AtBeginSection[]
{
  \begin{frame}<beamer>{Outline}
  \tableofcontents[currentsection,currentsubsection]
  \end{frame}
}
\setbeamertemplate{navigation symbols}{}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\institute[AIIT]{産業技術大学院大学(AIIT)}
\usetheme{Berkeley}
\usecolortheme{whale}
\setcounter{secnumdepth}{2}
\author{中鉢 欣秀・上田 隆一}
\date{}
\title{楽天APIを利用したアプリケーション}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.3.1 (Org mode 8.2.6)}}
\begin{document}

\maketitle

\section{楽天API}
\label{sec-1}
\begin{frame}[label=sec-1-1]{楽天APIとは？}
\begin{itemize}
\item \href{http://webservice.rakuten.co.jp/document/}{楽天ウェブサービス: API一覧}
\end{itemize}
\end{frame}

\begin{frame}[fragile,label=sec-1-2]{サンプルアプリ}
 \begin{itemize}
\item \href{https://github.com/ryuichiueda/rakuten_enpit_example}{Rakuten enPiT Example}
\begin{itemize}
\item \texttt{git clone} する
\end{itemize}
\item \texttt{bundle install} する
\item Herokuでアプリを作りアプリURLを取得
\begin{itemize}
\item \texttt{heroku create} する
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label=sec-1-3]{アプリIDの発行}
\begin{itemize}
\item 新規アプリを登録する
\begin{itemize}
\item \href{https://webservice.rakuten.co.jp/app/create}{楽天ウェブサービス: 新規アプリ登録}
\end{itemize}
\item アプリ名（任意），アプリのURL，認証コードを入力
\begin{itemize}
\item アプリID，アフィリエイトID等を控えておく
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[fragile,label=sec-1-4]{環境変数の設定}
 \begin{itemize}
\item アプリID（APPID）とアフィリエイトID（AFID）を環境変数に登録
\item \texttt{\textasciitilde{}/.bash\_profile} に次の行を追加（自分のID等に書き換えること）
\item \texttt{exit} して，再度 \texttt{vagrant ssh}
\end{itemize}

\begin{minted}[]{bash}
export APPID=102266705971259xxxx
export AFID=11b23d92.8f6b6ff4.11b23d93.???????
\end{minted}
\end{frame}

\begin{frame}[fragile,label=sec-1-5]{ローカルでの動作確認}
 \begin{itemize}
\item ローカルで動作確認する
\end{itemize}

\begin{minted}[]{bash}
ruby hello.rb -o 0.0.0.0
\end{minted}
\end{frame}

\section{Herokuで動作させる}
\label{sec-2}
\begin{frame}[fragile,label=sec-2-1]{Herokuの環境変数}
 \begin{itemize}
\item 次のコマンドで，Heroku内部にも環境変数を作る
\item 参考
\begin{itemize}
\item \href{https://devcenter.heroku.com/articles/config-vars}{Configuration and Config Vars | Heroku Dev Center}
\end{itemize}
\end{itemize}

\begin{minted}[]{bash}
heroku config:set APPID=102266705971259xxxx
heroku config:set AFID=11b23d92.8f6b6ff4.11b23d93.???????
\end{minted}
\end{frame}

\begin{frame}[fragile,label=sec-2-2]{Herokuでの動作確認}
 \begin{itemize}
\item Herokuに直接Pushしてみる
\item webブラウザで動作確認
\end{itemize}

\begin{minted}[]{bash}
git push heroku master
\end{minted}
\end{frame}

\section{Travis CI連携}
\label{sec-3}
\begin{frame}[fragile,label=sec-3-1]{.travis.ymlの再生成}
 \begin{block}{内容}
\begin{itemize}
\item \texttt{fork} して作業用のブランチを作成する
\item .travis.yml の削除と新規作成
\item 不要なRubyのバージョンを削除
\end{itemize}
\end{block}
\begin{block}{コマンド}
\begin{minted}[]{bash}
git fork
git branch new_feature
rm .travis.yml
travis init
travis heroku setup
emacs .travis.yml
\end{minted}
\end{block}
\end{frame}

\begin{frame}[fragile,label=sec-3-2]{Travis CIの環境変数}
 \begin{block}{内容}
\begin{itemize}
\item リポジトリで次のコマンドを打つ
\item 自分のAPPID，AFIDに書き換えること
\end{itemize}
\end{block}
\begin{block}{コマンド}
\begin{minted}[]{bash}
travis env set APPID 102266705971259xxxx
travis env set AFID 11b23d92.8f6b6ff4.11b23d93.???????
\end{minted}
\end{block}
\end{frame}

\begin{frame}[fragile,label=sec-3-3]{コミットしてpush}
 \begin{block}{内容}
\begin{itemize}
\item \texttt{add} して \texttt{commit}
\item 自分のリポジトリにpush
\end{itemize}
\end{block}
\begin{block}{コマンド}
\begin{minted}[]{bash}
git add .
git commit -m 'Update .travis.yml'
git push -u ychubach master
\end{minted}
\end{block}
\end{frame}



\section{演習}
\label{sec-4}
\begin{frame}[label=sec-4-1]{ローカルでサンプルを動かす}
\begin{itemize}
\item 自分のAPPIDを作成する
\item 仮想化環境とHerokuの環境変数を設定
\item ローカルで動かしてみよう
\item Herokuに直接Pushして動かしてみよう
\end{itemize}
\end{frame}
\begin{frame}[fragile,label=sec-4-2]{Travis経由で動かしてみよう}
 \begin{itemize}
\item サンプルをTravis経由で動作させてみよう
\begin{itemize}
\item Forkして，自分のリポジトリにpushできるようにする
\item \texttt{.travis.yml} の設定を変更する
\begin{itemize}
\item やり方は各自で考えてみよう
\end{itemize}
\item Travis CIに環境変数を設定する
\end{itemize}
\end{itemize}
\end{frame}
% Emacs 24.3.1 (Org mode 8.2.6)
\end{document}
